# 13. Напишите программу, в которой пользователь будет задавать две строки, а программа - определять количество вхождений одной строки в другой.
# Пример:
# Строка - "dabccabccabcc"
# Подстрока - "ab"
# Количество вхождений - 3
String1=input("Строка - ")
String2=input("Подстрока - ")
print('Количество вхождений - ',String1.count(String2))
